In [ ]:
'''Assuming 2 tables 
1.dept_table
2.emp_table'''

In [2]:
import pandas as pd

In [5]:
employee_table={'dept_id':[1,1,1,3,2,3,2,3,2],'name':['a','b','c','d','e','f','g','h','i'],'salary':[6000,2500,8000,3000,4500,2200,7800,4200,3720]}
department_table={'deprt':['sales','marketing','Data_engineer'],'dept_id':[1,2,3]}

In [9]:
emp_table=pd.DataFrame(employee_table)
dept_table=pd.DataFrame(department_table)

In [10]:
emp_table

   dept_id name  salary
0        1    a    6000
1        1    b    2500
2        1    c    8000
3        3    d    3000
4        2    e    4500
5        3    f    2200
6        2    g    7800
7        3    h    4200
8        2    i    3720

In [11]:
dept_table

           deprt  dept_id
0          sales        1
1      marketing        2
2  Data_engineer        3

In [13]:
df=emp_table.merge(dept_table,how='left',left_on='dept_id',right_on='dept_id')

In [28]:
grouped_df=df.groupby(['deprt','name']).sum().sort_values(['deprt','salary'],ascending=False).reset_index()

In [29]:
grouped_df

           deprt name  dept_id  salary
0          sales    c        1    8000
1          sales    a        1    6000
2          sales    b        1    2500
3      marketing    g        2    7800
4      marketing    e        2    4500
5      marketing    i        2    3720
6  Data_engineer    h        3    4200
7  Data_engineer    d        3    3000
8  Data_engineer    f        3    2200

In [44]:
for x in dept_table['deprt']:
    print('Department: ',x)
    y=grouped_df.loc[grouped_df['deprt']==x,'name'].iloc[1]
    print('Person getting 2nd highest salary:',y)

Department:  sales
Person getting 2nd highest salary: a
Department:  marketing
Person getting 2nd highest salary: e
Department:  Data_engineer
Person getting 2nd highest salary: d